# 오전

# PANDAS

### Series, 시리즈

In [46]:
import pandas as pd
import numpy as np

In [4]:
# series 생성 방법 : pd.Series(dict_data) : key는 index, 값은 atomic value
dict_data = {"a": 1, "b": 2, "c": 3}

s_data = pd.Series(dict_data)
s_data

a    1
b    2
c    3
dtype: int64

In [32]:
# series 생성 방법 : pd.Series(list) : index는 0부터 숫자로 생성, atomic value
list_data = [1, 2, 3, 4]
sl_data = pd.Series(list_data)
sl_data

0    1
1    2
2    3
3    4
dtype: int64

In [26]:
type(sl_data)

pandas.core.series.Series

In [25]:
# Series 접근방법 : 정수형 index | 인덱스 명
a = s_data[0], s_data["a"]

tuple

In [21]:
s_data[0:2] # [start : end] => start 포함, end 미포함

a    1
b    2
dtype: int64

In [22]:
s_data["a":"c"] # index명으로 접근하면 둘 다 포함

a    1
b    2
c    3
dtype: int64

In [23]:
s_data[["a", "c"]] # 여러개의 atomic value를 출력하고자 하면 [[인덱스명, 인덱스]]

a    1
c    3
dtype: int64

In [27]:
# 인덱스명을 지정 
tup_data = (1, 2, 3) # 튜플
tup_data = pd.Series(tup_data, index = ["a", "b", "c"])
tup_data

a    1
b    2
c    3
dtype: int64

In [33]:
# 인덱스명을 지정
list_data = [1, 2, 3]
list_data = pd.Series(tup_data, index = ["a", "b", "c"])
list_data

a    1
b    2
c    3
dtype: int64

In [36]:
list_data1 = [1, 2, 3, 4, 5]
index = ["a", "b", "c", "d", "e"]
list_data1 = pd.Series(list_data1, index = index)
list_data1

a    1
b    2
c    3
d    4
e    5
dtype: int64

### 데이터프레임

In [39]:
# 데이터프레임 : 시리즈가 모여서 2차원 배열이 됨
dict_data = {"c0": [1, 2, 3], "c1": [4, 5, 6], "c2": [6, 7, 8]}
df = pd.DataFrame(dict_data)
df

   c0  c1  c2
0   1   4   6
1   2   5   7
2   3   6   8

In [40]:
dict_data = {"c0": [1, 2, 3], "c1": [4, 5, 6], "c2": [6, 7, 8]}
df1 = pd.DataFrame(dict_data, index = ["a", "b", "c"])
df1

   c0  c1  c2
a   1   4   6
b   2   5   7
c   3   6   8

In [52]:
dict_data = {"c0": [1, 2, 3], "c1": [4, 5, 6], "c2": [6, 7, 8]}
index = ["a", "b", "c"]
columns = ["x0", "x1", "x2"]
df2 = pd.DataFrame(dict_data, index = index, columns = columns)
df2

    x0   x1   x2
a  NaN  NaN  NaN
b  NaN  NaN  NaN
c  NaN  NaN  NaN

In [62]:
# 숫자 1부터 10까지의 자료를 가지고 2차원 배열(5 * 2)로 구성한 데이터프레임 생성
# 컬럼명 = c_1, c_2로, 인덱스명은 "idx1, idx2, idx3, idx4, idx5"로 생성
# 데이터 프레임의 변수는 df
# 자료의 인덱스이름과 컬럼의 이름을 출력
data_ = (np.arange(10).reshape(5, 2) + 1) ** 2
id_ = ["idx1", "idx2", "idx3", "idx4", "idx5"]
col_ = ["c_1", "c_2"]
d = pd.DataFrame(data_, index = id_, columns = col_)
d

      c_1  c_2
idx1    1    4
idx2    9   16
idx3   25   36
idx4   49   64
idx5   81  100

In [61]:
print("columns : {}, indexname = {}".format(col_, id_))

columns : ['c_1', 'c_2'], indexname = ['idx1', 'idx2', 'idx3', 'idx4', 'idx5']

In [63]:
# 인덱스명 변경
d.index = ["id1", "id2", "id3", "id4", "id5"]
d

     c_1  c_2
id1    1    4
id2    9   16
id3   25   36
id4   49   64
id5   81  100

In [64]:
# 컬럼명 변경
d.columns = ["col1", "col2"]
d

     col1  col2
id1     1     4
id2     9    16
id3    25    36
id4    49    64
id5    81   100

In [65]:
# 인덱스명 변경
d.rename(index = {"id1":"ch1"}, inplace = True)
d

     col1  col2
ch1     1     4
id2     9    16
id3    25    36
id4    49    64
id5    81   100

In [66]:
# 컬럼명 변경
d.rename(columns = {"col1":"c1"}, inplace = True)
d

     c1  col2
ch1   1     4
id2   9    16
id3  25    36
id4  49    64
id5  81   100

In [72]:
# 컬럼 삭제
dd1 = df.drop("c1", axis = 0, inplace = True)
dd1

In [ ]:
# row 삭제
dd2 = df.drop("ch1", axis = 1, inplace = True)
dd2

In [74]:
exam_data = {"수학": [90, 80, 70], "영어": [98, 89, 95], "음악": [85, 95, 100],
            "체육": [100, 90, 90]}

df_ex1 = pd.DataFrame(exam_data, index = ["서준", "우현", "인아"])
df_ex1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [77]:
df_ex_copied = df_ex1.copy() # 새로운 주소에 df_ex1을 할당
df_ex_copied.drop("우현", inplace = True) # row 삭제, # drop의 기본값은 axis = 0
df_ex_copied

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [78]:
df_ex_copied1 = df_ex1.copy()
df_ex_copied1.drop(["영어", "체육"], axis = 1, inplace = True) # column 삭제
df_ex_copied1

    수학   음악
서준  90   85
우현  80   95
인아  70  100

In [81]:
# 데이터 프레임 접근 방법, 행을 접근 : loc[인덱스명], iloc[정수 인덱스]
# [:], [[ , ...]]
# "서준"의 자료 검색
df_ex1.loc["서준"]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [82]:
type(df_ex1.loc["서준"])

pandas.core.series.Series

In [83]:
df_ex1.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [84]:
type(df_ex1.loc["서준"])

pandas.core.series.Series

In [86]:
df_ex1.loc[["서준", "인아"]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [87]:
type(df_ex1.loc[["서준", "인아"]])

pandas.core.frame.DataFrame

In [116]:
df_ex1.iloc[0:2]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [89]:
type(df_ex1.iloc[0:2])

pandas.core.frame.DataFrame

In [92]:
# 컬럼 접근 방법 : df.컬럼명, df.["컬럼명"]
df_ex1.수학

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [93]:
type(df_ex1.수학)

pandas.core.series.Series

In [106]:
df_ex1[["영어", "수학"]]

    영어  수학
서준  98  90
우현  89  80
인아  95  70

In [113]:
df_ex1[["영어", "수학"]]

    영어  수학
서준  98  90
우현  89  80
인아  95  70

In [ ]:
# 데이터프레임에 접근하는 방법
# 인덱스로 접근하는 방법 : 이름과 정수 인덱스
# 이름으로 접근, df.loc[인덱스명] : 범위를 정할 때는 시작 : 끝, 여러 개의 값 [ , , ... ]
# 정수 인덱스로 접근 df.iloc[정수 인덱스] : 범위는 시작 정수 : 끝 정수 (끝은 미포함), 여러개 [0, 3]

In [114]:
# 행과 열을 접근하는 방법
# df.loc[인덱스명, 컬럼명]
df_ex1.loc["서준", "영어"]

98

In [115]:
# df.loc[인덱스명, 컬럼명]
df_ex1.at["서준", "영어"]

98

In [117]:
df_ex1.iloc[0, 1]

98

In [128]:
df_ex1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [133]:
# 서준과 우현의 영어와 수학 점수를 출력(인덱스명으로)
df_ex1.loc[["서준", "우현"], ["영어", "수학"]]

    영어  수학
서준  98  90
우현  89  80

In [134]:
# 1행부터 끝까지 영어 점수만 출력(정수 인덱스로)
df_ex1.loc[:, "영어"]

서준    98
우현    89
인아    95
Name: 영어, dtype: int64

In [135]:
# 마지막 자료의 마지막 과목만 출력(정수 인덱스로)
df_ex1.iloc[-1, -1]

90

In [136]:
# 우현의 모든 점수 출력 (인덱스명으로)
df_ex1.loc["우현", :]

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [138]:
# 우현과 민아의 모든 점수 출력 (정수 인덱스)
df_ex1.iloc[[1, 2], :]

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [141]:
# 철수의 점수 추가 (80, 70, 90, 100) row 추가
df_ex2 = df_ex1.copy()
df_ex2.loc["철수"] = [80, 70, 90, 100] # 철수에 값을 할당해버림
df_ex2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
철수  80  70   90  100

In [143]:
# "국어" 컬럼을 추가, 모든 사람의 점수를 할당 df[컬럼명] = 값
df_ex2["국어"] = [95, 80, 65, 100]
df_ex2

    수학  영어   음악   체육   국어
서준  90  98   85  100   95
우현  80  89   95   90   80
인아  70  95  100   90   65
철수  80  70   90  100  100

In [144]:
df_ex2.loc["복사"] = df_ex2.loc["철수"]
df_ex2

    수학  영어   음악   체육   국어
서준  90  98   85  100   95
우현  80  89   95   90   80
인아  70  95  100   90   65
철수  80  70   90  100  100
복사  80  70   90  100  100

In [ ]:
# df.loc[row, column]로 찾기 가능

In [147]:
df_ex2.transpose() # 많이 씀

     서준  우현   인아   철수   복사
수학   90  80   70   80   80
영어   98  89   95   70   70
음악   85  95  100   90   90
체육  100  90   90  100  100
국어   95  80   65  100  100

In [150]:
# 데이터프레임 : 인덱스 활용, 특정한 컬럼을 인덱스 컬럼으로 설정 df.set_index(컬럼명)
exam_data = {
    "이름": ["서준", "우현", "인아"],
    "수학": [90, 80, 70],
    "영어": [98, 89, 95],
    "음악": [85, 95, 100],
    "체육": [100, 90, 90]
}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [151]:
df.set_index("이름") # 이름 컬럼을 인덱스로 설정

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [156]:
df.set_index(["이름", "수학"])

       영어   음악   체육
이름 수학
서준 90  98   85  100
우현 80  89   95   90
인아 70  95  100   90

# 오후

In [178]:
# 숫자를 0부터 11까지 발생시켜 3 * 4로 배열을 재정의한 후 array를 데이터프레임으로 형 변환
data_1 = (np.arange(12).reshape(3, 4))
df_ex3 = pd.DataFrame(data_1)
df_ex3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [179]:
# 컬럼명을 ["c1", "c2", "c3", "c4"]
col_1 = ["c1", "c2", "c3", "c4"]
df_ex3 = pd.DataFrame(data_1, columns = col_1)
df_ex3

   c1  c2  c3  c4
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11

In [180]:
# "c1" 컬럼을 인덱스로
df_ex3.set_index("c1", inplace = True)
df_ex3

    c2  c3  c4
c1
0    1   2   3
4    5   6   7
8    9  10  11

In [198]:
# 인덱스 재배열 reindex(새로운 인덱스)
dict_data1 = {"c0":[1, 2, 3], "c1":[4, 5, 6], "c2":[7, 8, 9], "c3": [10, 11, 12],
             "c4": [13, 14, 15]}
df_ex4 = pd.DataFrame(dict_data1, index = ["r0", "r1", "r2"])
df_ex4

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [194]:
# 인덱스 재배열 : df.reindex(새로운 인덱스)
new_index = ["r0", "r1", "r2", "r3", "r4"]
df_ex4 = df_ex4.reindex(new_index, fill_value = 0, copy = False) # NaN은 0으로 채우기
df_ex4

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [196]:
df_ex4.reset_index(inplace = True) # index를 컬럼으로 변환, 
df_ex4                             # index를 제거하면 정수 인덱스 생성

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [197]:
df_ex4.set_index("index", inplace = True)
df_ex4

       c0  c1  c2  c3  c4
index
r0      1   4   7  10  13
r1      2   5   8  11  14
r2      3   6   9  12  15

In [199]:
df_ex4

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [201]:
df_ex4.sort_values(by = "c0", ascending = False) # query order by desc

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [202]:
df_ex4.sort_index(ascending = True)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [226]:
np.random.seed(0)
ran0 = np.random.randint(10, size = 3)
ran1 = np.random.randint(10, 20, size = 3)
ran2 = np.random.randint(20, 30, size = 3)
ran3 = np.random.randint(30, 40, size = 3)

dict_data3 = {"c0": ran0, "c1": ran1, "c2": ran2, "c3": ran3}
df_test1 = pd.DataFrame(dict_data3)
df_test1

   c0  c1  c2  c3
0   5  13  23  34
1   0  17  25  37
2   3  19  22  36

In [231]:
exam_data = {
    "이름": ["서준", "우현", "인아"],
    "수학": [90, 80, 70],
    "영어": [98, 89, 95],
    "음악": [85, 95, 100],
    "체육": [100, 90, 90]
}

df_1 = pd.DataFrame(exam_data)
df_1

test_data = df.set_index("이름")
print(test_data)
test_data.sort_index(ascending=False)
test_data.sort_values(by="영어", ascending = False)
test_data

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [232]:
# 인덱스 제거
test_data.reset_index(inplace = True)
test_data

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### 시리즈 연산

In [234]:
# 시리즈 연산
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({"국어": 40, "영어": 50, "수학": 10})
student1

국어    40
영어    50
수학    10
dtype: int64

In [255]:
student2 = pd.Series({"국어": 100, "수학": 90, "영어": 95, "과학": 95})
student2

국어    100
수학     90
영어     95
과학     95
dtype: int64

In [256]:
student1 + student2

과학      NaN
국어    140.0
수학    100.0
영어    145.0
dtype: float64

In [257]:
student1.add(student2)

과학      NaN
국어    140.0
수학    100.0
영어    145.0
dtype: float64

In [258]:
student1.add(student2, fill_value = 0)
# fill_value = 0 결측값 처리

과학     95.0
국어    140.0
수학    100.0
영어    145.0
dtype: float64

In [259]:
sr_add = student1.add(student2, fill_value = 0)
sr_sub = student1.sub(student2, fill_value = 0)
sr_mul = student1.mul(student2, fill_value = 0)
sr_div = student1.div(student2, fill_value = 0)

In [260]:
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], 
                      index = ["덧셈", "뺄셈", "곱셈", "나눗셈"])
result

       과학      국어          수학           영어
덧셈   95.0   140.0  100.000000   145.000000
뺄셈  -95.0   -60.0  -80.000000   -45.000000
곱셈    0.0  4000.0  900.000000  4750.000000
나눗셈   0.0     0.4    0.111111     0.526316

In [263]:
import seaborn as sns

In [268]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [271]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [293]:
tdf = titanic.loc[:, ["age", "fare"]]
tdf.head() # 처음 5라인을 보여줌

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [294]:
tdf.tail() # 마지막 5라인을 보여줌

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [295]:
sumtdf = tdf + 10

In [296]:
## 888열 결측치를 0으로 치환하고 10 더하기
tdf.add(10, fill_value = 0).tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888  10.0  33.45
889  36.0  40.00
890  42.0  17.75

In [297]:
tdf.describe()
# count 개수
# mean 평균
# std 표준편차
# min 최소값
# 25%, 50%, 75%, max

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [298]:
tdf["age"].count()

714

### 외부 파일 다루기

In [306]:
# read_csv_sample.csv 작업하고 있는 디렉토리에 data 폴더 생성 후 저장
import os
os.getcwd()

'C:\\Users\\UNIVERSE\\YGL_AI\\JungilWoong\\python'

In [305]:
os.listdir()

['.ipynb_checkpoints',
 '2.module-beautifulsoup-basic.ipynb',
 '211028_python_day1.ipynb',
 '211028_python_day1.py',
 '211028_python_day1_output.py',
 '211029_python_day2.ipynb',
 '211029_python_day2.py',
 '211101_python_day3.ipynb',
 '211101_python_day3.py',
 '211101_python_func_lab.py',
 '211102_python_day4.ipynb',
 '211103_python_day5.ipynb',
 '211104_python_class_day6.ipynb',
 '211104_python_day6.ipynb',
 '211105_python_day7.ipynb',
 '211108_python_day8.ipynb',
 'basic.txt',
 'Data',
 'file.txt',
 'Flask_basic.ipynb',
 'score.txt',
 'test_module.ipynb',
 'U.ipynb']

In [ ]:
file_name = "./Data/read_csv_sample.csv"

In [307]:
# 파일 불러오기 - 첫라인을 column으로 인식
df = pd.read_csv(file_name)
df

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [308]:
# 파일 불러오기 - 첫라인을 row로 인식
df1 = pd.read_csv(file_name, header = None)
df1

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [311]:
# 인덱스 컬럼을 지정하면서 가져오기
df2 = pd.read_csv(file_name, index_col = "c0")
df2

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

In [314]:
# 인덱스와 컬럼명을 지정하면서 가져오기
df3 = pd.read_csv(file_name, index_col = "0", skiprows = 1, 
                  names = ["0", "1", "4", "7"])
df3

   1  4  7
0
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
df3.to_csv("./data/to_csv_sample.csv")

In [323]:
# seaborn의 titanic 자료의 age, fare, class 컬럼,
# 10번째 데이터부터 60번째 데이터 까지만 추출
csvtdf = titanic.loc[10:60, ["age", "fare", "class"]]
csvtdf

     age      fare   class
10   4.0   16.7000   Third
11  58.0   26.5500   First
12  20.0    8.0500   Third
13  39.0   31.2750   Third
14  14.0    7.8542   Third
15  55.0   16.0000  Second
16   2.0   29.1250   Third
17   NaN   13.0000  Second
18  31.0   18.0000   Third
19   NaN    7.2250   Third
20  35.0   26.0000  Second
21  34.0   13.0000  Second
22  15.0    8.0292   Third
23  28.0   35.5000   First
24   8.0   21.0750   Third
25  38.0   31.3875   Third
26   NaN    7.2250   Third
27  19.0  263.0000   First
28   NaN    7.8792   Third
29   NaN    7.8958   Third
30  40.0   27.7208   First
31   NaN  146.5208   First
32   NaN    7.7500   Third
33  66.0   10.5000  Second
34  28.0   82.1708   First
35  42.0   52.0000   First
36   NaN    7.2292   Third
37  21.0    8.0500   Third
38  18.0   18.0000   Third
39  14.0   11.2417   Third
40  40.0    9.4750   Third
41  27.0   21.0000  Second
42   NaN    7.8958   Third
43   3.0   41.5792  Second
44  19.0    7.8792   Third
45   NaN    8.0500   Third
46   NaN   15.5000   Third
47   NaN    7.7500   Third
48   NaN   21.6792   Third
49  18.0   17.8000   Third
50   7.0   39.6875   Third
51  21.0    7.8000   Third
52  49.0   76.7292   First
53  29.0   26.0000  Second
54  65.0   61.9792   First
55   NaN   35.5000   First
56  21.0   10.5000  Second
57  28.5    7.2292   Third
58   5.0   27.7500  Second
59  11.0   46.9000   Third
60  22.0    7.2292   Third

In [ ]:
# 위 데이터를 ./data/titanic_sample.csv 파일로 저장
csvtdf.to_csv("./data/titanic_sample.csv ")

In [332]:
randomsampletdf = csvtdf.sample(20, random_state = 100)
randomsampletdf

     age      fare   class
16   2.0   29.1250   Third
42   NaN    7.8958   Third
47   NaN    7.7500   Third
45   NaN    8.0500   Third
43   3.0   41.5792  Second
60  22.0    7.2292   Third
15  55.0   16.0000  Second
36   NaN    7.2292   Third
35  42.0   52.0000   First
54  65.0   61.9792   First
48   NaN   21.6792   Third
41  27.0   21.0000  Second
10   4.0   16.7000   Third
21  34.0   13.0000  Second
28   NaN    7.8792   Third
30  40.0   27.7208   First
57  28.5    7.2292   Third
53  29.0   26.0000  Second
46   NaN   15.5000   Third
27  19.0  263.0000   First

In [333]:
# 위 데이터를 ./data/titanic_random_sample.csv
randomsampletdf.to_csv("./data/titanic_random_sample.csv")

In [339]:
ppdf1 = pd.read_excel("./data/남북한발전전력량.xlsx")
print(ppdf1)

  전력량 (억㎾h) 발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...  2007  \
0        남한     합계  1077  1186  1310  1444  1650  1847  2055  2244  ...  4031
1       NaN     수력    64    51    49    60    41    55    52    54  ...    50
2       NaN     화력   484   573   696   803  1022  1122  1264  1420  ...  2551
3       NaN    원자력   529   563   565   581   587   670   739   771  ...  1429
4       NaN    신재생     -     -     -     -     -     -     -     -  ...     -
5        북한     합계   277   263   247   221   231   230   213   193  ...   236
6       NaN     수력   156   150   142   133   138   142   125   107  ...   133
7       NaN     화력   121   113   105    88    93    88    88    86  ...   103
8       NaN    원자력     -     -     -     -     -     -     -     -  ...     -

   2008  2009  2010  2011  2012  2013  2014  2015  2016
0  4224  4336  4747  4969  5096  5171  5220  5281  5404
1    56    56    65    78    77    84    78    58    66
2  2658  2802  3196  3343  3430  3581  3427  3402  3523
3  1510  1478  1486  1547  1503  1388  1564  1648  1620
4     -     -     -     -    86   118   151   173   195
5   255   235   237   211   215   221   216   190   239
6   141   125   134   132   135   139   130   100   128
7   114   110   103    79    80    82    86    90   111
8     -     -     -     -     -     -     -     -     -

[9 rows x 29 columns]

In [340]:
ppdf2 = pd.read_excel("./data/남북한발전전력량.xlsx", header = None)
print(ppdf2)

          0       1     2     3     4     5     6     7     8     9   ...  \
0  전력량 (억㎾h)  발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...
1         남한      합계  1077  1186  1310  1444  1650  1847  2055  2244  ...
2        NaN      수력    64    51    49    60    41    55    52    54  ...
3        NaN      화력   484   573   696   803  1022  1122  1264  1420  ...
4        NaN     원자력   529   563   565   581   587   670   739   771  ...
5        NaN     신재생     -     -     -     -     -     -     -     -  ...
6         북한      합계   277   263   247   221   231   230   213   193  ...
7        NaN      수력   156   150   142   133   138   142   125   107  ...
8        NaN      화력   121   113   105    88    93    88    88    86  ...
9        NaN     원자력     -     -     -     -     -     -     -     -  ...

     19    20    21    22    23    24    25    26    27    28
0  2007  2008  2009  2010  2011  2012  2013  2014  2015  2016
1  4031  4224  4336  4747  4969  5096  5171  5220  5281  5404
2    50    56    56    65    78    77    84    78    58    66
3  2551  2658  2802  3196  3343  3430  3581  3427  3402  3523
4  1429  1510  1478  1486  1547  1503  1388  1564  1648  1620
5     -     -     -     -     -    86   118   151   173   195
6   236   255   235   237   211   215   221   216   190   239
7   133   141   125   134   132   135   139   130   100   128
8   103   114   110   103    79    80    82    86    90   111
9     -     -     -     -     -     -     -     -     -     -

[10 rows x 29 columns]